In [4]:
# Dependencies
import pandas as pd

In [5]:
# Save path to data set in a variable
data_file = "Resources/dataSet.csv"

In [8]:
df=pd.read_csv(data_file)

In [16]:
df.head()

   id           Full Name  Gender   Amount       Car
0   1        Minnnie Rean    male  15484.5      Jeep
1   2     Ursa Torricella  female  13443.3    Saturn
2   3     Joyann Pirolini    male   9095.6       Ram
3   4      Sharl Ridsdell  female  11871.6     Dodge
4   5  Laurence Jovasevic    male  13459.8  Chrysler

In [17]:
df.tail()

       id               Full Name  Gender   Amount       Car
995   996         Almire Stickins    male   9795.0  Infiniti
996   997          Taite Pocknell  female  19485.4       BMW
997   998  Roselin Bartlomiejczyk  female  19330.8     Mazda
998   999           Amandi Wenban  female  16113.7   Lincoln
999  1000         Meta Abramovici    male   7637.8  Plymouth

In [20]:
# Display a statistical overview of the DataFrame
df.head(2)

   id        Full Name  Gender   Amount     Car
0   1     Minnnie Rean    male  15484.5    Jeep
1   2  Ursa Torricella  female  13443.3  Saturn

In [28]:
df[["Amount","Car","Gender"]].head(5)

    Amount       Car  Gender
0  15484.5      Jeep    male
1  13443.3    Saturn  female
2   9095.6       Ram    male
3  11871.6     Dodge  female
4  13459.8  Chrysler    male

In [5]:
# Reference a single column within a DataFrame
data_file_df["Amount"].head()

0    15484.5
1    13443.3
2     9095.6
3    11871.6
4    13459.8
Name: Amount, dtype: float64

In [6]:
# Reference multiple columns within a DataFrame
data_file_df[["Amount", "Gender"]].head()

    Amount  Gender
0  15484.5    male
1  13443.3  female
2   9095.6    male
3  11871.6  female
4  13459.8    male

In [7]:
# The mean method averages the series
average = data_file_df["Amount"].mean()
average

9988.738099999993

In [33]:
df["Amount"].mean(),df["Amount"].min()

(9988.738100000002, 15.3)

In [8]:
# The sum method adds every entry in the series
total = df["Amount"].sum()
total

9988738.100000001

In [37]:
df["Car"].unique()

array(['Jeep', 'Saturn', 'Ram', 'Dodge', 'Chrysler', 'Cadillac',
       'Pontiac', 'Nissan', 'Lexus', 'Volkswagen', 'Suzuki', 'Kia',
       'Mercury', 'Audi', 'Bugatti', 'BMW', 'Mazda', 'GMC', 'Ford',
       'Mercedes-Benz', 'Land Rover', 'Chevrolet', 'Toyota', 'Honda',
       'Subaru', 'Oldsmobile', 'MINI', 'Lincoln', 'Mitsubishi', 'Isuzu',
       'Infiniti', 'Eagle', 'Saab', 'Buick', 'Volvo', 'Lotus', 'Maserati',
       'Jensen', 'Hyundai', 'Maybach', 'Corbin', 'Acura', 'Ferrari',
       'Plymouth', 'Studebaker', 'Jaguar', 'Rolls-Royce', 'Aston Martin',
       'Merkur', 'CitroÃ«n', 'Daewoo', 'Tesla', 'Porsche', 'Scion', 'Geo',
       'Hummer', 'Lamborghini', 'Fiat', 'Bentley', 'Peugeot', 'Austin',
       'Spyker'], dtype=object)

In [40]:
df["Gender"].unique()

array(['male', 'female', 'non-binary'], dtype=object)

In [44]:
# The value_counts method counts unique values in a column
df["Gender"].value_counts()

male          455
female        446
non-binary     99
Name: Gender, dtype: int64

In [43]:
df["Amount"]/1000

0      15.4845
1      13.4433
2       9.0956
3      11.8716
4      13.4598
        ...
995     9.7950
996    19.4854
997    19.3308
998    16.1137
999     7.6378
Name: Amount, Length: 1000, dtype: float64

In [48]:
df["new_colum"]=df["Amount"]/1000

In [49]:
df.head()

   id           Full Name  Gender   Amount       Car  new_colum
0   1        Minnnie Rean    male  15484.5      Jeep    15.4845
1   2     Ursa Torricella  female  13443.3    Saturn    13.4433
2   3     Joyann Pirolini    male   9095.6       Ram     9.0956
3   4      Sharl Ridsdell  female  11871.6     Dodge    11.8716
4   5  Laurence Jovasevic    male  13459.8  Chrysler    13.4598

In [50]:
df["Amount"]*1000+2

0      15484502.0
1      13443302.0
2       9095602.0
3      11871602.0
4      13459802.0
          ...
995     9795002.0
996    19485402.0
997    19330802.0
998    16113702.0
999     7637802.0
Name: Amount, Length: 1000, dtype: float64

In [52]:
df["test"]=df["Amount"]*1000+2

In [11]:
# Calculations can also be performed on Series and added into DataFrames as new columns
thousands_of_dollars = data_file_df["Amount"]/1000
data_file_df["Thousands of Dollars"] = thousands_of_dollars

data_file_df.head()

   id           Full Name  Gender   Amount       Car  Thousands of Dollars
0   1        Minnnie Rean    male  15484.5      Jeep               15.4845
1   2     Ursa Torricella  female  13443.3    Saturn               13.4433
2   3     Joyann Pirolini    male   9095.6       Ram                9.0956
3   4      Sharl Ridsdell  female  11871.6     Dodge               11.8716
4   5  Laurence Jovasevic    male  13459.8  Chrysler               13.4598